app/controllers/forums_controller.rb

SELECT SQL_NO_CACHE * FROM `forums`
---
  def index
    @forums = Forum.all

SELECT SQL_NO_CACHE * FROM `forums` WHERE (`forums`.`id` = 1)
---
  def show
    @forum = Forum.find(params[:id])

SELECT SQL_NO_CACHE * FROM `forums` WHERE (`forums`.`id` = 1)
---
  def edit
    @forum = Forum.find(params[:id])

INSERT INTO `forums` (`name`, `updated_at`, `description`, `created_at`) VALUES('ruby on rails', '2009-09-17 04:16:06', 'questions related to ruby on rails', '2009-09-17 04:16:06')
---
  def create
    @forum = Forum.new(params[:forum])

    respond_to do |format|
      if @forum.save