app/controllers/sessions_controller.rb

  def create
    self.current_user = User.authenticate(params[:login], params[:password])
    @user = User.find(current_user.id)
---
SELECT SQL_NO_CACHE * FROM `users` WHERE (`users`.`login` = 'ganesh') AND (users.state = 'active') LIMIT 1