app/controllers/topics_controller.rb

  def load_forum
    @forum = Forum.find(params[:forum_id])
---
SELECT SQL_NO_CACHE * FROM `forums` WHERE (`forums`.`id` = 1)

  def show
    @topic = @forum.topics.find(params[:id])
---
SELECT SQL_NO_CACHE * FROM `topics` WHERE (`topics`.`id` = 2 AND (`topics`.forum_id = 1))

  def create
    @topic = @forum.topics.build(params[:topic])

    respond_to do |format|
      if @topic.save
---
INSERT INTO `topics` (`updated_at`, `body`, `subject`, `forum_id`, `user_id`, `created_at`) VALUES('2009-09-17 04:16:37', 'testing active record', 'Active records not create', 1, NULL, '2009-09-17 04:16:37')