app/controllers/users_controller.rb

SELECT SQL_NO_CACHE `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'ganeshprasadsr@rediffmail.com' AND `users`.id <> 3) LIMIT 1
UPDATE `users` SET `password_reset_code` = '80c4006ce53aa9378e8b49f4655d10d2f38c3efc', `updated_at` = '2009-09-18 04:18:58' WHERE `id` = 3
---
    def forgot_password
      return unless request.post?
      if @user = User.find_by_email(params[:user][:email])
        @user.forgot_password
        @user.save